Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: ཞུམ་པའི་སེམས་སམ། སྒྲིབ་པས་མགོ་རྨོངས་པའི་སེམས་བསྐྱེད་དུ་མི་དྲན་ཏེ། གཞན་དུ་ན་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚོགས་བསྩགས་པའི་ཕྱིར་བྱང་ཆུབ་ཀྱི་སེམས་ཡེ་ཤེས་གཞན་གྱིས་མི་ཐུབ་ཅིང་བརྒལ་བར་དཀའ་བའི་སྙིང་པོ་དང་ལྡན་པ་བསྐྱེད་དོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། ངའི་སྔོན་གྱི་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པ། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱས་པའི་སྦྱོར་བ་དག་དང་། དེས་སྙིང་རྗེ་ཆེན་པོའི་སེམས་རབ་ཏུ་ཐོབ་སྟེ། སེམས་ཅན་ཡོངས་སུ་བསྐྱབས་པ་དང་། ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། ཡོངས་སུ་སྦྱང་བར་བྱས་པའི་སྦྱོར་བ་དག་དང་།
en: Instead, I developed the aspiration for gathering the accumulations for omniscience, an aspiration that had an invincible knowledge and unconquerable essence.

source: སངས་རྒྱས་མཆོད་ཅིང་བསྙེན་བཀུར་བའི་སྦྱོར་བ་དག་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་བཙལ་བའི་དོན་དུ་བླ་མ་ལ་རིམ་གྲོར་བྱས་པའི་སྦྱོར་བ་དག་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་བཟུང་བའི་དོན་དུ་ལུས་ཡོངས་སུ་བཏང་བའི་སྦྱོར་བ་དག་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་བསྲུང་བའི་དོན་དུ་རང་གི་སྲོག་ཡོངས་སུ་བཏང་བའི་སྦྱོར་བ་དེ་དག་ནི་བསྟན་པར་བྱ་ན། བསྐལ་པ་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱང་ཟད་པར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་ངས་ནི། ཆོས་རྒྱ་མཚོ་དེ་སྙེད་ཅིག་ལས་ཀྱང་། ཚིག་དང་ཡི་གེ་འགའ་ཙམ་ཡང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པ་ལ་བརྩོན་པ་དང་། རང་གི་སེམས་ཀྱི་རྒྱུད་ངེས་པར་ཤེས་པར་བྱ་བ་ལ་བརྩོན་པ་དང་།
en: “Noble one, it is like this: an ocean of kalpas would pass if I were to teach my past perfect practices, my engagement in purifying buddha realms, my engagement in protecting, ripening, and purifying beings with my attainment of great compassion, my engagement in making offerings to and serving buddhas, my engagement in serving gurus in order to seek the good Dharma, my engagement in giving away my body in order to obtain the good Dharma, and my engagement in giving up my life in order to protect the good Dharma.

source: ཕ་རོལ་གྱིས་ཆོས་མངོན་དུ་ཐོས་པར་བྱ་བ་ལ་བརྩོན་པ་དང་། འཇིག་རྟེན་པའི་ཡེ་ཤེས་སྣང་བ་ཐམས་ཅད་རབ་ཏུ་བརྗོད་པ་ལ་བརྩོན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཡེ་ཤེས་ཐམས་ཅད་རབ་ཏུ་བརྗོད་པ་ལ་བརྩོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཁོར་བའི་བདེ་བ་ཡོངས་སུ་བསྐྱེད་པ་ལ་བརྩོན་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་ཡང་དག་པར་བསྔགས་པ་ལ་བརྩོན་པས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་ཡོངས་སུ་བཏང་བས་མ་ཉོས་པའམ། བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་བཏང་བས་མོས་པ་གང་ཡང་མེད་དེ།
en: “Noble one, there is not one word or letter from all that ocean of the Dharma for which I did not give up the kingdom of a cakravartin or all my possessions through being dedicated to saving all beings, dedicated to attaining definitive understanding of the continuum of my mind, dedicated to others hearing the Dharma, dedicated to the elucidation of the light of worldly knowledge, dedicated to the elucidation of all world-transcending knowledge, dedicated to giving rise to happiness in saṃsāra for all beings, and dedicated to praising the qualities of all the tathāgatas.

source: དེ་ལྟར་ང་ཉིད་ཀྱི་སྔོན་གྱི་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པ་བསྟན་པར་བྱ་ན། བསྐལ་བ་རྒྱ་མཚོ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཟད་པར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ངས་རྣམ་པ་དེ་ལྟ་བུའི་ཚོགས་ཀྱི་སྟོབས་དང་། དགེ་བའི་རྩ་བའི་རྒྱུ་བསྩགས་པའི་སྟོབས་དང་། མོས་པ་རྒྱ་ཆེན་པོའི་སྟོབས་དང་། ཡོན་ཏན་ལ་ནན་ཏན་དུ་བྱ་བའི་སྟོབས་དང་། ཆོས་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཁོང་དུ་ཆུད་པར་བྱ་བའི་སྟོབས་དང་།
en: In that way, an ocean of kalpas as numerous as the atoms in an anabhilāpyānabhilāpya of buddha realms would pass by if I were to teach my perfect practices in the past.

source: ཤེས་རབ་ཀྱི་མིག་གི་སྟོབས་དང་། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱི་སྟོབས་དང་། སྨོན་ལམ་ཆེན་པོའི་སྟོབས་དང་། སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་དང་། ཤིན་ཏུ་སྦྱངས་པའི་མངོན་པར་ཤེས་པའི་སྟོབས་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བའི་སྟོབས་ཀྱིས་ཆོས་ཀྱི་ལུས་ཡོངས་སུ་དག་པ་དུས་གསུམ་དུ་ཐ་མི་དད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: “Noble one, in that way, I attained the pure Dharma body that is undifferentiated by the three times through the strength of such accumulations, through the strength of the accumulation of the causal roots of merit, through the strength of a vast aspiration, through the strength of practicing the qualities, through the strength of correctly comprehending all Dharmas, through the strength of the eyes of wisdom, through the strength of the blessing of the tathāgatas, through the strength of great prayers, through the strength of great compassion, through the strength of perfectly purified higher cognitions, and through the strength of being taken into the care of the kalyāṇamitras.

source: བླ་ན་མེད་པའི་གཟུགས་ཀྱི་ལུས་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་དམིགས་པ་ཐམས་ཅད་དུ་རྗེས་སུ་སོང་བ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་རབ་ཏུ་གཞོལ་བ། ཐམས་ཅད་དུ་རབ་ཏུ་གནས་པ་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ། སྟོན་པ་འགྲོ་བ་ཐམས་ཅད་ཀྱི། ཡིད་དུ་འོང་བ་ཡང་ཡོངས་སུ་སྦྱངས་སོ། །
en: I also purified the unsurpassable form body that transcends all worlds, that is perceived by all beings according to their aspirations, that is spread throughout all buddha realms, that is present everywhere, that manifests all miracles in every place, and that is attractive to all beings.

source: རིགས་ཀྱི་བུ་ངས་ལུས་ཐོབ་པ་ཕུན་སུམ་ཚོགས་པ། བསྐལ་པ་རྒྱ་མཚོ་མཐའ་ཡས་པས་ཡོངས་སུ་གྲུབ་པ། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོས། འབྱུང་བར་དཀའ་བ་མཐོང་བར་དཀའ་བ་འདི་ལ་ལྟོས།
en: “Noble one, regard this perfect body I have attained, which has been accomplished through an endless ocean of kalpas and which is rare to appear and rare to see in many hundreds of thousands of quintillions of kalpas.

source: རིགས་ཀྱི་བུ་ང་ནི་དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པའི་སེམས་ཅན་རྣམས་ཀྱི་རྣ་ལམ་དུ་ཡང་མི་འོང་ན། མཐོང་བར་ལྟ་ཇི་ཞིག་སྨོས།
en: “Noble one, those beings who have not developed roots of merit cannot hear me, let alone see me.

source: རིགས་ཀྱི་བུ་སེམས་ཅན་གང་དག་ངའི་མིང་ཐོས་པ་ཙམ་གྱིས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་ཡོད་དོ། །མཐོང་བ་ཙམ་དང་། རེག་པ་ཙམ་དང་།
en: “Noble one, those beings who just hear my name become irreversible in their progress toward the highest, complete enlightenment.

source: བསྐྱལ་པ་ཙམ་དང་། རྗེས་སུ་འབྲང་བ་ཙམ་དང་། རྨི་ལམ་དུ་མཐོང་བ་ཙམ་དང་། རྨི་ལམ་དུ་མིང་ཐོས་པ་ཙམ་གྱིས་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་ཡོད་དེ། སེམས་ཅན་ལ་ལས་ནི་ང་ཉིན་ཞག་གཅིག་ཏུ་དྲན་པར་བྱས་ན་ཡོངས་སུ་སྨིན་པར་འགྱུར་རོ། །ལ་ལས་ནི་ཞག་བདུན་དང་། ལ་ལས་ནི་ཟླ་བ་ཕྱེད་དང་།
en: Those who just see me, touch me, accompany me, follow me, see me in a dream, or hear my name in a dream become irreversible in their progress toward the highest, complete enlightenment.

source: ལ་ལས་ནི་ཟླ་བ་གཅིག་དང་། ལ་ལས་ནི་ལོ་གཅིག་དང་། ལ་ལས་ནི་ལོ་བརྒྱ་དང་། ལ་ལས་ནི་བསྐལ་པ་གཅིག་དང་། ལ་ལས་ནི་བསྐལ་པ་བརྒྱ་ནས། ལ་ལས་ནི་བསྐལ་བ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དུ་ང་རྗེས་སུ་དྲན་པར་བྱས་ན།
en: “Some, through thinking of me, become ripened in one day, some in one week, some in a fortnight, some in a month, some in a year, some in a hundred years, some in a kalpa, some in a hundred kalpas, and some in as many kalpas as there are atoms in an anabhilāpyānabhilāpya of buddha realms.

source: ཡོངས་སུ་སྨིན་པར་འགྱུར་རོ། །ལ་ལས་ནི་ཚེ་གཅིག་ཏུ་རྗེས་སུ་དྲན་པར་བྱས་ན། ཡོངས་སུ་སྨིན་པར་འགྱུར་རོ། །ལ་ལས་ནི་ཚེའི་རྒྱུད་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་ཡོངས་སུ་སྨིན་པར་འགྱུར་རོ། །
en: Some become ripened after as many lifetimes as there are atoms in an anabhilāpyānabhilāpya of buddha realms.

source: སེམས་ཅན་ལ་ལས་ནི་ངའི་འོད་མཐོང་བས་ཡོངས་སུ་སྨིན་པར་འགྱུར་རོ། །ལ་ལས་ནི་འོད་ཟེར་བཀྱེ་བ་མཐོང་བས་ལ་ལས་ནི་ཞིང་བསྐྱོད་པས་ལ་ལས་ནི་གཟུགས་ཀྱི་ལུས་བསྟན་པས་ལ་ལས་ནི་དགའ་བར་བྱས་པས་ཡོངས་སུ་སྨིན་པར་འགྱུར་ཏེ།
en: Some become ripened through seeing my light, some through seeing the light rays I radiate, some through the realm shaking, some through the manifestation of my form body, and some through rejoicing in it.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཐབས་ཀྱི་ཚུལ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་སེམས་ཅན་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ། །
en: “Noble one, in that way, through as many methods as there are atoms in a buddha realm, beings become irreversible in their progress toward the highest, complete enlightenment.

source: རིགས་ཀྱི་བུ་སེམས་ཅན་གང་གིས་ངའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཐོབ་པ་དེ་དག་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་སྐྱེའོ། །
en: “Noble one, the beings who hear of my pure buddha realm will be reborn in pure buddha realms.

source: གང་གིས་ངའི་ལུས་ཡོངས་སུ་དག་པ་མཐོང་བར་གྱུར་པ་དེ་དག་ནི་ངའི་ལུས་ལྟ་བུར་སྐྱེ་བར་འགྱུར་གྱིས་རིགས་ཀྱི་བུ་ངའི་ལུས་རྣམ་པར་དག་པ་འདི་ལ་ལྟོས་ཤིག །
en: Those who see my pure body will be reborn with a body like mine. Therefore, noble one, look at my body.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་ལུས་ལ་བསམ་པ་དང་། བ་སྤུའི་བུ་ག་རེ་རེ་ལ་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་རྒྱ་མཚོ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་སངས་རྒྱས་སྐྱེ་བས་ཡོངས་སུ་གང་བ་མཐོང་ངོ་། །
en: Sudhana, the head merchant’s son, contemplated the body of the bodhisattva Samanta­bhadra and saw an anabhilāpyānabhilāpya of oceans of buddha realms in each pore.

source: ཞིང་རྒྱ་མཚོ་རེ་རེ་ན་ཡང་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་རྒྱ་མཚོས་ཀུན་ནས་བསྐོར་བ་མང་པོ་བཞུགས་པ་མཐོང་ངོ་། །
en: He saw in each of those oceans of realms tathāgatas encircled by oceans of assemblies of bodhisattvas.

source: ཞིང་རྒྱ་མཚོ་དེ་དག་ཐམས་ཅད་ཀྱང་གཞི་སྣ་ཚོགས་དང་དབྱིབས་སྣ་ཚོགས་དང་། རྒྱན་སྣ་ཚོགས་དང་འཁོར་ཡུག་སྣ་ཚོགས་དང་སྤྲིན་སྣ་ཚོགས་དང་ནམ་མཁའ་སྣ་ཚོགས་ཀྱིས་ཀུན་ནས་ཁེབས་པ་དང་། སངས་རྒྱས་འབྱུང་བ་སྣ་ཚོགས་དང་ཆོས་ཀྱི་འཁོར་ལོ་སྣ་ཚོགས་ཀྱི་དབྱངས་དང་ལྡན་པར་མཐོང་ངོ་། །
en: He saw all those oceans of realms as having various grounds, various shapes, various arrays, and various Cakravāla mountain ranges, covered by various clouds and various skies, and possessing various appearances of buddhas and the sound of various Dharma wheels.

source: བ་སྤུའི་བུ་ག་རེ་རེ་ལ་ཇི་ལྟ་བ་བཞིན་དུ་བ་སྤུའི་བུ་ག་མ་ལུས་པ་ཐམས་ཅད་དང་།
en: What he saw in each pore he saw in all pores without exception, in all the physical signs and features of a great being, and in all the greater and smaller parts of the body.

source: མཚན་ཐམས་ཅད་དང་དཔེ་བྱད་བཟང་པོ་ཐམས་ཅད་དང་། ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་ལ་ཡང་དེ་བཞིན་ཏེ། ཞིང་རྒྱ་མཚོ་རེ་རེ་ནས་ཀྱང་སངས་རྒྱས་ཀྱི་སྐུ་སྤྲུལ་པའི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ནས་ཕྱོགས་བཅུར་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པ་མཐོང་ངོ་། །
en: He saw clouds of emanations of bodies of buddhas, as numerous as the atoms in all buddha realms, appearing in each of the oceans of realms, pervading all the world realms in the ten directions, and ripening beings for the highest, complete enlightenment.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པས་རྗེས་སུ་བསྟན་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་ལུས་ཀྱི་ཁོངས་སུ་གཏོགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་ཞུགས་ཏེ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་གྱུར་ཏོ། །
en: Sudhana, the head merchant’s son, having been taught the instructions and teachings of the bodhisattva Samanta­bhadra, entered all the world realms that were within the body of the bodhisattva Samanta­bhadra and ripened beings.

source: དེ་ལྟར་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དགེ་བའི་བཤེས་གཉེན་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་གི་དྲུང་དུ་ཕྱིན་ཏེ། མཐོང་བ་དང་བསྙེན་བཀུར་བས་ཡེ་ཤེས་ཀྱི་སྣང་བ་དང་། དགེ་བའི་རྩ་བ་བསྩགས་པ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་མཐོང་སྟེ། དགེ་བའི་རྩ་བ་བསྩགས་པར་གྱུར་བ་དེའི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ། །སྟོང་གི་ཆར་ཡང་མ་ཡིན་བརྒྱ་སྟོང་གི་ཆར་ཡང་མ་ཡིན།
en: The roots of merit accumulated by Sudhana, the head merchant’s son, through the light of knowledge by coming before, seeing, and honoring as many kalyāṇamitras as there are atoms in a buddha realm, were not a hundredth of the roots of merit accumulated by seeing the bodhisattva Samanta­bhadra; they were not even a thousandth, were not even a trillionth, and could not even be an enumeration, a fraction, a number, an analogy, or a basis for it.

source: བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་གི་ཆར་ཡང་མ་ཡིན་ཏེ། གྲངས་དང་ཆ་དང་བགྲང་བ་དང་དཔེར་བྱ་བ་དང་། རྒྱུར་བྱ་བ་ཙམ་དུ་ཡང་མི་ཕོད་དོ། །དེས་དང་པོ་སེམས་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་མཐོང་བའི་བར་དེར་སངས་རྒྱས་ཀྱི་ཞིང་རྒྱ་མཚོ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཇི་སྙེད་ཅིག་ལ་ཞུགས་པར་གྱུར་པ་དེ་དག་པས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་བར་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་བ་སྤུའི་བུ་ག་རེ་རེར་སངས་རྒྱས་ཀྱི་ཞིང་རྒྱ་མཚོ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་མང་པོ་ལ་སེམས་ཀྱི་སྐད་ཅིག་གཅིག་གིས་ཞུགས་པར་གྱུར་ཏེ།
en: However many successions of oceans of buddha realms Sudhana apprehended from first developing the aspiration for enlightenment until he saw the bodhisattva Samanta­bhadra, he apprehended in each instant of mind even more successions of oceans of buddha realms, as many as there are atoms in an anabhilāpyānabhilāpya of buddha realms, in each of the bodhisattva Samanta­bhadra’s pores.

source: བ་སྤུའི་བུ་ག་རེ་རེར་ཇི་ལྟ་བ་དེ་བཞིན་དུ་བ་སྤུའི་བུ་ག་མ་ལུས་པ་ཐམས་ཅད་ལ་ཡང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་རྣམ་པར་གནོན་པ་ཕྱི་མའི་མཐའི་མུར་ཐུག་པའི་བསྐལ་བར་བྱིན་གྱིས་བརླབས་པ། འཇིག་རྟེན་གྱི་ཁམས་རྒྱས་པར་འགེངས་པས་ཞུགས་ཀྱང་ཞིང་རྒྱ་མཚོ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པའི་མཐར་ཕྱིན་པར་མ་གྱུར་ཏེ། ཞིང་རྒྱ་མཚོའི་ལྷུན་དང་ཞིང་རྒྱ་མཚོའི་བྱེ་བྲག་དང་། ཞིང་རྒྱ་མཚོ་ཡོངས་སུ་བསྡུ་བ་དང་། ཞིང་རྒྱ་མཚོ་ཡོངས་སུ་འགྲུབ་པ་དང་། ཞིང་རྒྱ་མཚོ་འཇིག་པ་དང་། ཞིང་རྒྱ་མཚོ་རྣམ་པར་ཕྱེ་བ་དང་། སངས་རྒྱས་བྱུང་བ་རྒྱ་མཚོ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་དང་། སངས་རྒྱས་བྱུང་བ་རྒྱ་མཚོའི་སྐུ་དང་། སངས་རྒྱས་བྱུང་བ་རྒྱ་མཚོའི་བྱེ་བྲག་དང་། སངས་རྒྱས་བྱུང་བ་རྒྱ་མཚོ་ཡོངས་སུ་བསྡུ་བ་དང་། སངས་རྒྱས་བྱུང་བ་རྒྱ་མཚོ་ཡོངས་སུ་འབྱུང་བ་དང་། སངས་རྒྱས་བྱུང་བ་རྒྱ་མཚོ་ཡོངས་སུ་འཇིག་པ་དང་།
en: Just as it was in each of his pores, so it was in all his pores without exception, and even if in each instant of mind Sudhana were to arrive at world realms as numerous as the atoms in an anabhilāpyānabhilāpya of buddha realms and continue spreading through world realms until the last of future kalpas, he would still not reach the end of those successions of oceans of buddha realms.

source: བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་དང་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོའི་ལུས་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོའི་བྱེ་བྲག་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ཡོངས་སུ་བསྡུ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ཡོངས་སུ་འབྱུང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ཡོངས་སུ་འཇིག་པ་དང་། སེམས་ཅན་གྱི་ཁམས་ལ་འཇུག་པ་དང་།
en: He would not reach the end of the forms of the oceans of realms, the particulars of the oceans of realms, the groupings of the oceans of realms, the origination of the oceans of realms, the destruction of the oceans of realms, the categories of the oceans of realms, the succession of the oceans of the appearances of buddhas, the bodies of the oceans of the appearances of buddhas, the particulars of the oceans of the appearances of buddhas, the groupings of the oceans of the appearances of buddhas, the originations of the oceans of the appearances of buddhas, the destruction of the oceans of the appearances of buddhas, the oceans of the bodhisattva assemblies of followers, the successions of the oceans of the bodhisattva assemblies of followers, the particulars of the oceans of the bodhisattva assemblies of followers, the groupings of the oceans of the bodhisattva assemblies of followers, the origination of the oceans of the bodhisattva assemblies of followers, the destruction of the oceans of the bodhisattva assemblies of followers, the entries into the realms of beings, the entries in each instant into the knowledge of the faculties of beings, the realizations of the knowledge of the faculties of beings, the ripening and guiding of beings, or the practices of the profound bodhisattva miracles and would not reach the end of the ocean of the ascending of bodhisattva bhūmis.

source: སྐད་ཅིག་རེ་རེས་སེམས་ཅན་གྱི་དབང་པོ་ཤེས་པ་ལ་འཇུག་པ་དང་། སེམས་ཅན་གྱི་དབང་པོ་ཤེས་པ་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་ཞིང་གདུལ་བ་དང་།
en: He was active in some realms for a kalpa.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་འཕྲུལ་བ་ཟབ་མོ་ལ་རྣམ་པར་གནས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་གནན་པའི་རྣམ་པར་གནོན་པ་རྒྱ་མཚོའི་མཐར་ཡང་ཕྱིན་པར་མ་གྱུར་ཏེ། དེ་ཞིང་ལ་ལར་ནི་བསྐལ་པར་རྣམ་པར་སྤྱད་པར་གྱུར་ཏོ། །
en: He was active in some realms for as many kalpas as there are atoms in an anabhilāpyānabhilāpya of realms, and he did not depart from those realms.

source: ཞིང་ལ་ལར་ནི་བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་དུ་སྤྱད་པར་གྱུར་ཏེ། ཞིང་དེ་དག་ནས་ཀྱང་གཡོས་པ་མེད་དོ། །སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཡང་ཞིང་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་ལ་འཇུག་ཅིང་སེམས་ཅན་རྣམས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་གྱུར་ཏེ། དེས་དེ་ལྟར་མཐར་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་སྨོན་ལམ་རྒྱ་མཚོ་མཉམ་པ་ཉིད་ཀྱི་བར་དུ་འང་ཐོབ་པར་གྱུར་ཏོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་མཉམ་པ་ཉིད་དང་། ཞིང་ཐམས་ཅད་ལུས་ཀྱིས་རྒྱས་པར་དགང་བ་མཉམ་པ་ཉིད་དང་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་པར་རྒྱས་པར་དགང་བ་མཉམ་པ་ཉིད་དང་། མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་རྣམ་པར་འཕྲུལ་བ་ཡོངས་སུ་བསྟན་པས་རྒྱས་པར་དགང་བ་མཉམ་པ་ཉིད་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་མཉམ་པ་ཉིད་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམ་པར་དག་པ་མཉམ་པ་ཉིད་དང་། དབྱངས་བརྗོད་པ་མཉམ་པ་ཉིད་དང་།
en: In each instant of mind, he ripened beings for the highest, complete enlightenment in a vast extent of an ocean of realms with no end or middle, until in that way he eventually attained equality with the ocean of the prayers and the conduct of the bodhisattva Samanta­bhadra.

source: དབྱངས་ཀྱི་ཡན་ལག་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་སྦྱོར་བ་མཉམ་པ་ཉིད་དང་། སྟོབས་དང་མི་འཇིག་པ་མཉམ་པ་ཉིད་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་སྤྱོད་པ་མཉམ་པ་ཉིད་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་མཉམ་པ་ཉིད་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྣམ་པར་འཕྲུལ་པ་མཉམ་པ་ཉིད་ཀྱི་རྗེས་སུ་ཐོབ་པར་གྱུར་ཏོ། །
en: He attained equality with all the tathāgatas, equality with their pervasion of all realms by their bodies, equality with their fulfillment of conduct, equality with their manifesting the miraculous manifestation of the attainment of complete buddhahood, equality with their turning the wheel of the Dharma, equality with their pure discernment, equality with the utterances of their voices, equality with the engagement in the oceans of all the aspects of their voices, equality with their great love and great compassion, and equality with the miraculous manifestation of the inconceivable liberations of the bodhisattvas.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོས་བསྐལ་བ་དང་། བསྐལ་པ་འབྱམ་ཀླས་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་པོ་དེ་དག་བརྣན་ཏེ་མངོན་པར་བརྗོད་པའི་ཕྱིར་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་སྨོན་ལམ་བཏབ་པ། །ཇི་སྙེད་སུ་དག་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན། །དུས་གསུམ་གཤེགས་པ་མི་ཡི་སེང་གེ་ཀུན། །
en: The bodhisattva mahāsattva Samanta­bhadra then composed these verses in order to further elucidate kalpas, the vast extent of kalpas, and world realms as numerous as the atoms in an anabhilāpyānabhilāpya of buddha realms: However many lions among men there are In the three times, in the worlds in the ten directions, I pay homage to them all without exception, With purity of body, speech, and mind.

source: བདག་གིས་མ་ལུས་དེ་དག་ཐམས་ཅད་ལ། ལུས་དང་ངག་ཡིད་དང་བས་ཕྱག་བགྱིའོ། །བཟང་པོ་སྤྱོད་པའི་སྨོན་ལམ་སྟོབས་དག་གིས། །རྒྱལ་བ་ཐམས་ཅད་ཡིད་ཀྱིས་མངོན་སུམ་དུ། །ཞིང་གི་རྡུལ་སྙེད་ལུས་རབ་བཏུད་པ་ཡིས། །
en: {1} Thinking that all the jinas are before me, With the power of the prayer of good conduct, I bow down toward all the jinas With as many bodies as there are atoms in the realms.

source: རྒྱལ་བ་ཀུན་ལ་རབ་ཏུ་ཕྱག་འཚལ་ལོ། །རྡུལ་གཅིག་སྟེང་ན་རྡུལ་སྙེད་སངས་རྒྱས་རྣམས། །སངས་རྒྱས་སྲས་ཀྱི་དབུས་ན་བཞུགས་པ་དག། །
en: {2} There are as many buddhas as atoms within a single atom, Seated in the midst of bodhisattvas.

source: དེ་ལྟར་ཆོས་ཀྱི་དབྱིངས་རྣམས་མ་ལུས་པར། །ཐམས་ཅད་རྒྱལ་བ་དག་གིས་གང་བར་མོས །
en: I focus on the entire realm of phenomena, Without exception, being filled by jinas in that way.

source: དེ་དག་བསྔགས་པ་མི་ཟད་རྒྱ་མཚོ་རྣམས། །དབྱངས་ཀྱི་ཡན་ལག་རྒྱ་མཚོའི་སྒྲ་ཀུན་གྱིས། །རྒྱལ་བ་ཀུན་གྱི་ཡོན་ཏན་རབ་བརྗོད་ཅིང་། །བདེ་བར་གཤེགས་པ་ཐམས་ཅད་བདག་གིས་བསྟོད། །
en: {3} I recite a praise of all the sugatas, Enumerating the qualities of all the jinas, With unending oceans of eulogies And the sound of oceans of every quality of voice.

source: མེ་ཏོག་དམ་པ་ཕྲེང་བ་དམ་པ་དང་། །སིལ་སྙན་རྣམས་དང་བྱུག་པའི་གདུགས་མཆོག་དང་། །མར་མེ་མཆོག་དང་བདུག་པ་དམ་པ་ཡིས། །རྒྱལ་བ་དེ་དག་ལ་ནི་མཆོད་པར་བགྱི། །
en: {4} I make an offering to those jinas Of perfect flowers, perfect garlands, Perfect music, ointments, and parasols, Perfect lights, and perfect incenses.

source: ན་བཟའ་དམ་པ་རྣམས་དང་དྲི་མཆོག་དང་། །ཕྱེ་མའི་ཕུར་མ་རི་རབ་མཉམ་པ་དང་། །ཁྱད་པར་ཅན་གྱི་རྒྱན་མཆོག་ཐམས་ཅད་ཀྱིས། །རྒྱལ་བ་དེ་དག་ལ་ནི་མཆོད་པར་བགྱི། །
en: {5} I make offerings to those jinas Of perfect clothing and perfect perfumes, Pouches of scented powders equal to Mount Meru, And all perfect, sublime displays.

source: མཆོད་པ་གང་རྣམས་བླ་མེད་རྒྱ་ཆེ་བ། །དེ་དག་རྒྱལ་བ་ཐམས་ཅད་ལ་ཡང་མོས། །
en: {6} Offerings that are unsurpassable and exalted I am resolved to offer to all the jinas.

source: བཟང་པོ་སྤྱོད་ལ་དད་པའི་སྟོབས་དག་གིས། །རྒྱལ་བ་ཀུན་ལ་ཕྱག་འཚལ་མཆོད་པར་བགྱི། །
en: I praise and make offerings to all the jinas Through the power of devotion to good conduct.

source: འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་དབང་གིས་ན། །ལུས་དང་ངག་དང་དེ་བཞིན་ཡིད་ཀྱིས་ཀྱང་། །སྡིག་པ་བདག་གིས་བགྱིས་པ་ཅི་མཆིས་པ། །དེ་དག་ཐམས་ཅད་བདག་གིས་སོ་སོར་བཤགས། །
en: {7} Whatever bad actions I have done Under the power of desire, anger, and ignorance, With my body, speech, and mind, I make a confession of them all.

source: ཕྱོགས་བཅུའི་རྒྱལ་བ་ཀུན་དང་སངས་རྒྱས་སྲས། །རང་རྒྱལ་རྣམས་དང་སློབ་དང་མི་སློབ་དང་། །འགྲོ་བ་རྣམས་ཀྱི་བསོད་ནམས་གང་ལ་ཡང་། །དེ་དག་ཀུན་གྱི་རྗེས་སུ་བདག་ཡི་རང་། །
en: {8} I am rejoicing in the entirety of merit In the ten directions that is created by beings, By practicing and accomplished pratyeka­buddhas, By the bodhisattvas, and by all the jinas.

source: གང་རྣམས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་སྒྲོན་མ་དག །བྱང་ཆུབ་རིམ་པར་སངས་རྒྱས་མ་ཆགས་བརྙེས། །མགོན་པོ་དེ་དག་བདག་གིས་ཐམས་ཅད་ལ། །འཁོར་ལོ་བླ་ན་མེད་པ་བསྐོར་བར་བསྐུལ། །
en: {9} I make the request to all the lords, The lamps of the worlds in the ten directions, Who have attained without impediment the enlightenment of buddhahood, That they turn the unsurpassable wheel.

source: མྱ་ངན་འདའ་སྟོན་གང་བཞེད་དེ་དག་ལ། །འགྲོ་བ་ཀུན་ལ་ཕན་ཞིང་བདེ་བའི་ཕྱིར། །བསྐལ་བ་ཞིང་གི་རྡུལ་སྙེད་བཞུགས་པར་ཡང་། །བདག་གིས་ཐལ་མོ་རབ་སྦྱར་གསོལ་བར་བགྱི། །
en: {10} With palms placed together, I supplicate Those who wish to manifest passing into nirvāṇa That they remain for as many kalpas as there are atoms in the realms, For the benefit and happiness of all beings.

source: ཕྱག་འཚལ་བ་དང་མཆོད་ཅིང་བཤགས་པ་དང་། །རྗེས་སུ་ཡི་རང་བསྐུལ་ཞིང་གསོལ་བ་ཡི། །དགེ་བ་ཅུང་ཟད་བདག་གིས་ཅི་བསྩགས་པ། །ཐམས་ཅད་བདག་གིས་བྱང་ཆུབ་ཕྱིར་བསྔོའོ། །
en: {11} Whatever little virtue I have accumulated Through homage, offering, confession, Rejoicing, supplication, and entreating, I dedicate it all to enlightenment.

source: འདས་པའི་སངས་རྒྱས་རྣམས་དང་ཕྱོགས་བཅུ་ཡི། །འཇིག་རྟེན་དག་ན་གང་བཞུགས་མཆོད་པར་གྱུར།
en: {12} May the buddhas of the past and those who are present In the worlds of the ten directions be offered to.

source: གང་ཡང་མ་བྱོན་དེ་དག་རབ་མྱུར་བར། །བསམ་རྫོགས་བྱང་ཆུབ་རིམ་པར་སངས་རྒྱས་སྤྱོན། །
en: May those in the future swiftly fulfill Their aspirations for the enlightenment of buddhahood.

source: ཕྱོགས་བཅུ་ག་ལའི་ཞིང་རྣམས་ཇི་སྙེད་པ། །དེ་དག་རྒྱ་ཆེར་ཡོངས་སུ་དག་པར་གྱུར། །
en: {13} May the realms that are in the ten directions Become purified and sublime.

source: བྱང་ཆུབ་ཤིང་དབང་དྲུང་གཤེགས་རྒྱལ་བ་དང་། །
en: May they become filled with jinas, who have come To the Bodhi tree, the lord of trees, and with bodhisattvas.

source: སངས་རྒྱས་སྲས་ཀྱིས་རབ་ཏུ་གང་བར་ཤོག །ཕྱོགས་བཅུའི་སེམས་ཅན་གང་རྣམས་ཇི་སྙེད་པ། །དེ་དག་རྟག་ཏུ་ནད་མེད་བདེ་བར་གྱུར། །
en: {14} However many beings there are in the ten directions, May they all be always happy and healthy.
